[
    {
        "title": "Wideband Full Duplex Transceiver",
        "imageSrc": "/projects/FD.png",
        "description": "I am taping out a transceiver that aims to demonstrate the capability of both transmitting and receiving at the same time in the same frequency through the same antenna (aka Same-Channel Full-Duplex). Dr. Abhishek Kumar demonstrated in 2018 that this is possible in 2.4 GHz for a 20 MHz bandwidth, I am extending this to show the same at 7 GHz with a 400 MHz bandwidth",
        "links":[
            {
                "link": "https://ieeexplore.ieee.org/document/8315501",
                "annotation": "Kumar et al. (TCAS-I, Oct-2018)"
            },
            {
                "link": "https://www.ee.iitm.ac.in/ani/",
                "annotation": "Advisor: Prof. Aniruddhan"
            }
        ],
        "year": 2026,
        "type":"research"
    },
    {
        "title": "RF Clock Distribution for 5G Terahertz",
        "imageSrc": "/projects/imc.jpeg",
        "description": 
        "I worked at the 5G Testbed (Now called 6G TeraHertz Testbed) during my Undergraduate Studies. The lab was preparing a demonstration of Intelligent Reflecting Surfaces to be displayed at the Indian Mobile Congress 2024. I designed a Clock Rack (Seen at left bottom of the image) which provides GPS Synchronized RF clocks upto 100s of MHz. The rack was used to synchronize the Baseband Units used for the demonstration.",
        "links": [
            { 
                "link": "https://www.linkedin.com/posts/reachiitm_iitmadras-imc2024-iitmadras-activity-7252925384659251200-6GJp?utm_source=share&utm_medium=member_desktop&rcm=ACoAADFUEDMBg6bwAubEMKMjJ4_VbT5FUlfOeD0", 
                "annotation": "Linkedin Post by IIT Madras"
            },
            {
                "link": "https://www.rkganti.in/",
                "annotation": "Advisor: Prof. RK Ganti"
            }
        ],
        "year": 2024,
        "type": "research"
    },
    {
        "title": "Neural Networks with Sigmoid Weights for RRAM Crossbars",
        "imageSrc": "/projects/bnn.png",
        "description": "As part of courework, we were tasked with training a 2-layer neural network, quantizing the weights to 1-bit post-training and inferencing them on a passive RRAM Synaptic Array. We explored this further and tried formulating training methods for using sigmoid weights directly to reflect the binary nature instead of quantizing post-training. Although limited by diminishing gradients for deeper networks, we found that reduced quantization induced error significantly. We further explored stochastic training methods such simultaneous perturbation (SPSA) and annealing (SA). We've compared our results on the same dataset as used by Li et al in 2018 paper in the write-up below",
        "links": [
            {
                "link": "https://github.com/RishiNandha/CMOS-Binary-Neural-Network/blob/47cf71b09709e14cf668042fba5bd74f387e40de/Documentation.pdf",
                "annotation": "Write-Up"
            },
            {
                "link":"https://scholar.google.com/citations?user=kyjPyQMAAAAJ&hl=en",
                "annotation": "Advisor: Prof. Bhaswar" 
            },
            {
                "link": "https://www.nature.com/articles/s41467-023-40770-4",
                "annotation": "Li et al.'s Paper"
            }
        ],
        "year": 2024,
        "type":"research"
    },
    {
        "title": "Open Source - Quantum Datasets for Fast-Forwarding",
        "imageSrc":"/projects/vff.png",
        "description": "We collaborated with the IBM Qiskit Team (From both IBM Research and STFC UK) on adding natively quantum datasets to the Qiskit environment. Variational Fast-Forwarding is a pipeline introduced in 2020 to simulate atomic systems beyond coherence time on NISQ hardware. I moved the recent literature on this into code and contributed a dataset as a result (Image adopted from Filip et al.)",
        "links": [
            {
                "link": "https://github.com/qiskit-community/qiskit-machine-learning/pull/916#issue-3057905689",
                "annotation": "Link to PR"
            },
            {
                "link": "https://research.ibm.com/people/dhinakaran-vinayagamurthy",
                "annotation": "Advisor: Dr. Dhinakaran (IBM)"
            }
        ],
        "year": 2025,
        "type": "other"
    }
]

