[
  {
    "title": "Crawling Back To Me - Semitone (IIT Madras)",
    "embedUrl": "https://www.youtube.com/embed/F1HVBgu8__M?si=N3MrXI15ousYHmIQ",
    "description": "Semitone was a band we formed at IIT Madras. Crawling Back To Me was our first original. I particularly love the work we did on this one. (Wait till the end for the dual solo!)",
    "type": "original",
    "linkType": "youtube"
  },
  {
    "title": "Song Of Mine - Live at IITKGP Open Air Theatre",
    "embedUrl": "https://www.youtube.com/embed/wmkwitoa1EI?si=2z7x0VVrHvbk4kl0",
    "description": "This one is a song about finding solace in Music. Dharani called me up one day and I still remember how we tracked the entire bass part in two takes. (The sax solo makes me very happy every single time)",
    "type": "original",
    "linkType": "youtube"
  },
  {
    "title": "A Saudadic Dream - For Mixed Orchestra",
    "embedUrl": "https://www.youtube.com/embed/8fkk_yOJy-k?si=-w4wDcfvAk9Uxh4Z&amp;start=260",
    "description": "I wrote a piece for the online orchestra 'Reddit Symphony' (4:20 - 6:19). 'Saudade' is a feeling of profound longing. It's about a dream that starts with grief and resentful but ends with promises and hope.",
    "type": "original",
    "linkType": "youtube"
  },
  {
    "title": "Master Of Puppets, at IIT Madras Open Air Theatre",
    "embedUrl": "https://www.youtube.com/embed/QjHDSATHPkE?si=BVtvFXxsR4if7dCV",
    "description": "A day before the show we decided we'll do this, and one of the best experiences of my life. We had to recover this from multiple mobile recordings!",
    "type": "cover",
    "linkType": "youtube"
  },
  {
    "title": "Hangar 18, in a jam room",
    "embedUrl": "https://www.youtube.com/embed/El_q5R1cCSs?si=XTXnPVC8MRIKTM_P",
    "description": "We decided we have to cover a dual guitar song before my roommate from undergrad days graduated. So we covered this one",
    "type": "cover",
    "linkType": "youtube"
  },
  {
    "title": "Standchen (Schubert), with an Online Orchestra",
    "embedUrl": "https://www.youtube.com/embed/_QTiIRVnF24?si=LQeUgVrIMBSrgXMf",
    "description": "A beautiful Lieder by Schubert, arranged by Arianna. I played the Contrabasso part on an Electric Bass. We decided to keep it for the depth it added to the tone!",
    "type": "cover",
    "linkType": "youtube"
  }
]
